Reports/Д_СводныйФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Report>
		<Properties>
			<Name>Д_СводныйФР</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccountingRegisters/Учетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccountingRegister>
		<Properties>
			<Name>Учетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Учетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Предприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПлана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКРХ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Крахмал</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиДок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Предприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Предприятия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрефиксПредприятия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПредприятия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Учет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АльтНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытияУчет</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорпоративныйEMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьВОтчетахГД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедетсяВалютныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролировать10</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролировать41</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролировать43</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранзитныйСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранзитноеПодразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьТранзитныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаАрендодателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйОбъемХранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролироватьОФК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет79</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьДебиторскуюЗадолженность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяВалютаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтопроведениеПереводов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкаМСФО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственноеПредприятие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗакрытияЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗакрытияЗатрат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьЗаявкиНаоплатуБезСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяПолитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеПолитики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОрганизацииДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДопСписокРеспондентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Признак</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EMail</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокДокументовПодразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетПоПодразделениям</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/Д_СводныйФР/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОтчета = Новый Структура;
	
	ПараметрыОтчета.Вставить("Сценарий2", Неопределено);
	
	Для Каждого ЭлементНастройки Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		
		Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			
			Если Строка(ЭлементНастройки.Параметр) = "ПериодОтчета" Тогда
				ПараметрыОтчета.Вставить("ПериодОтчета", ЭлементНастройки.Значение);
				
			ИначеЕсли Строка(ЭлементНастройки.Параметр) = "Сценарий1" Тогда
				ПараметрыОтчета.Вставить("Сценарий1", ЭлементНастройки.Значение);				
				
			ИначеЕсли Строка(ЭлементНастройки.Параметр) = "Сценарий2" Тогда
				ПараметрыОтчета.Вставить("Сценарий2", ЭлементНастройки.Значение);
				
			ИначеЕсли Строка(ЭлементНастройки.Параметр) = "Интервал" Тогда
				ПараметрыОтчета.Вставить("Интервал", ЭлементНастройки.Значение);			
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СКД = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	СформироватьТекстЗапроса(ПараметрыОтчета, СКД);
	
	Источник = новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД);
	КомпоновщикНастроек2 = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек2.Инициализировать(Источник);
	КомпоновщикНастроек2.ЗагрузитьНастройки(КомпоновщикНастроек.Настройки);
	КомпоновщикНастроек2.ЗагрузитьПользовательскиеНастройки(КомпоновщикНастроек.ПользовательскиеНастройки);
	
	НастройкиДляКомпоновкиМакета = КомпоновщикНастроек2.ПолучитьНастройки();
	
	Для Каждого ТекЭлемент Из НастройкиДляКомпоновкиМакета.ПараметрыДанных.Элементы Цикл
		
		Если Строка(ТекЭлемент.Параметр) = "НачалоПериода" Тогда
			ТекЭлемент.Значение = ПараметрыОтчета.ПериодОтчета.ДатаНачала;
		КонецЕсли;
		
		Если Строка(ТекЭлемент.Параметр) = "КонецПериода" Тогда
			ТекЭлемент.Значение = ПараметрыОтчета.ПериодОтчета.ДатаОкончания;
		КонецЕсли;
		
		Если Строка(ТекЭлемент.Параметр) = "Дата1" Тогда
			ТекЭлемент.Значение = ПараметрыОтчета.ПериодОтчета.ДатаНачала;
		КонецЕсли;
		
		Если Строка(ТекЭлемент.Параметр) = "Дата2" Тогда
			ТекЭлемент.Значение = ПараметрыОтчета.ПериодОтчета.ДатаОкончания;
		КонецЕсли; 		
		
		Если Строка(ТекЭлемент.Параметр) = "ЭквивалентнаяВалюта" Тогда
			СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НастройкиДляКомпоновкиМакета, "ЭквивалентнаяВалюта", ?(ЗначениеЗаполнено(ТекЭлемент.Значение), ТекЭлемент.Значение, УЧ_Сервер.НациональнаяВалюта()));	
		КонецЕсли;
		
		Если Строка(ТекЭлемент.Параметр) = "Сценарий2" Тогда
			Если ЗначениеЗаполнено(ТекЭлемент.Значение) и ТекЭлемент.Использование Тогда
				НастройкиДляКомпоновкиМакета.Структура[0].Колонки[0].Имя = "СценарийПФ"; 				
			Иначе
				ТекЭлемент.Значение = Справочники.СценарииПланирования.ПустаяСсылка();
				ТекЭлемент.Использование = Истина;
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;	
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, НастройкиДляКомпоновкиМакета, ДанныеРасшифровки, Неопределено);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);    
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьТекстЗапроса(ПараметрыОтчета, СКД)
	
	Если ПараметрыОтчета.Сценарий1 = Справочники.СценарииПланирования.Факт Тогда
		СКД.НаборыДанных.НаборДанных3.Элементы.НаборДанных1.Запрос = ТекстЗпросаФакт("1");
	КонецЕсли;
	
	Если ПараметрыОтчета.Сценарий2 = Справочники.СценарииПланирования.Факт Тогда
		СКД.НаборыДанных.НаборДанных3.Элементы.НаборДанных2.Запрос = ТекстЗпросаФакт("2");
	КонецЕсли;	
	
	СКД.НаборыДанных.НаборДанных3.Элементы.НаборДанных1.Запрос = СтрЗаменить(СКД.НаборыДанных.НаборДанных3.Элементы.НаборДанных1.Запрос, "Квартал", ПараметрыОтчета.Интервал);
	СКД.НаборыДанных.НаборДанных3.Элементы.НаборДанных2.Запрос = СтрЗаменить(СКД.НаборыДанных.НаборДанных3.Элементы.НаборДанных2.Запрос, "Квартал", ПараметрыОтчета.Интервал);
	
КонецПроцедуры

&НаСервере
Функция ТекстЗпросаФакт(ИндексНабора)
		
	 ТекстЗапроса = "ВЫБРАТЬ
	 |	Предприятия.Ссылка КАК Предприятие,
	 |	УчетныеПолитики.СтатьяПереводФР КАК СтатьяПереводФР
	 |ПОМЕСТИТЬ вт_ПереводФР
	 |ИЗ
	 |	Справочник.Предприятия КАК Предприятия
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетныеПолитики КАК УчетныеПолитики
	 |		ПО Предприятия.УчетнаяПолитика = УчетныеПолитики.Ссылка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	УчетныйОборотыДтКт.Предприятия.Родитель КАК ТипПредприятия,
	 |	УчетныйОборотыДтКт.Предприятия КАК Предприятия,
	 |	УчетныйОборотыДтКт.Период КАК Период,
	 |	СУММА(-ЕСТЬNULL(УчетныйОборотыДтКт.СуммаОборот, 0)) КАК СуммаНачало,
	 |	0 КАК Сумма_90_91,
	 |	0 КАК СуммаПереводФР
	 |ПОМЕСТИТЬ ВТ_Данные
	 |ИЗ
	 |	РегистрБухгалтерии.Учетный.ОборотыДтКт(&НачалоПериода, &КонецПериода, Квартал, СчетДт В (&Счет75_2), , СчетКт В ИЕРАРХИИ (&Счет99), , СценарийПлана = &Сценарий%Индекс%) КАК УчетныйОборотыДтКт
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	УчетныйОборотыДтКт.Предприятия.Родитель,
	 |	УчетныйОборотыДтКт.Предприятия,
	 |	УчетныйОборотыДтКт.Период
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	УчетныйОбороты.Предприятия.Родитель,
	 |	УчетныйОбороты.Предприятия,
	 |	УчетныйОбороты.Период,
	 |	0,
	 |	СУММА(ВЫБОР
	 |			КОГДА УчетныйОбороты.Счет В (&Счет91)
	 |					И УчетныйОбороты.Субконто1 = вт_ПереводФР.СтатьяПереводФР
	 |				ТОГДА 0
	 |			ИНАЧЕ -ЕСТЬNULL(УчетныйОбороты.СуммаОборот, 0)
	 |		КОНЕЦ),
	 |	0
	 |ИЗ
	 |	РегистрБухгалтерии.Учетный.Обороты(&НачалоПериода, &КонецПериода, Квартал, Счет В ИЕРАРХИИ (&Счета_90_91), , СценарийПлана = &Сценарий1, НЕ КорСчет В ИЕРАРХИИ (&Счет99), ) КАК УчетныйОбороты
	 |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ПереводФР КАК вт_ПереводФР
	 |		ПО УчетныйОбороты.Предприятия = вт_ПереводФР.Предприятие
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	УчетныйОбороты.Предприятия.Родитель,
	 |	УчетныйОбороты.Предприятия,
	 |	УчетныйОбороты.Период
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	УчетныйОборотыДтКт.Предприятия.Родитель,
	 |	УчетныйОборотыДтКт.Предприятия,
	 |	УчетныйОборотыДтКт.Период,
	 |	СУММА(ЕСТЬNULL(УчетныйОборотыДтКт.СуммаОборот, 0)),
	 |	0,
	 |	0
	 |ИЗ
	 |	РегистрБухгалтерии.Учетный.ОборотыДтКт(&НачалоПериода, &КонецПериода, Квартал, СчетДт В ИЕРАРХИИ (&Счет99), , СчетКт В (&Счет75_2), , СценарийПлана = &Сценарий%Индекс%) КАК УчетныйОборотыДтКт
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	УчетныйОборотыДтКт.Предприятия.Родитель,
	 |	УчетныйОборотыДтКт.Предприятия,
	 |	УчетныйОборотыДтКт.Период
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	УчетныйОборотыДтКт.Предприятия.Родитель,
	 |	УчетныйОборотыДтКт.Предприятия,
	 |	УчетныйОборотыДтКт.Период,
	 |	0,
	 |	0,
	 |	СУММА(-ЕСТЬNULL(УчетныйОборотыДтКт.СуммаОборот, 0))
	 |ИЗ
	 |	РегистрБухгалтерии.Учетный.ОборотыДтКт(&НачалоПериода, &КонецПериода, Квартал, СчетДт В (&Счет91), , СчетКт В ИЕРАРХИИ (&Счета79_76_6), , СценарийПлана = &Сценарий%Индекс%) КАК УчетныйОборотыДтКт
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ПереводФР КАК вт_ПереводФР
	 |		ПО УчетныйОборотыДтКт.СубконтоДт1 = вт_ПереводФР.СтатьяПереводФР
	 |			И УчетныйОборотыДтКт.Предприятия = вт_ПереводФР.Предприятие
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	УчетныйОборотыДтКт.Предприятия.Родитель,
	 |	УчетныйОборотыДтКт.Предприятия,
	 |	УчетныйОборотыДтКт.Период
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	УчетныйОборотыДтКт.Предприятия.Родитель,
	 |	УчетныйОборотыДтКт.Предприятия,
	 |	УчетныйОборотыДтКт.Период,
	 |	0,
	 |	0,
	 |	СУММА(ЕСТЬNULL(УчетныйОборотыДтКт.СуммаОборот, 0))
	 |ИЗ
	 |	РегистрБухгалтерии.Учетный.ОборотыДтКт(&НачалоПериода, &КонецПериода, Квартал, СчетДт В ИЕРАРХИИ (&Счета79_76_6), , СчетКт В (&Счет91), , СценарийПлана = &Сценарий%Индекс%) КАК УчетныйОборотыДтКт
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ПереводФР КАК вт_ПереводФР
	 |		ПО УчетныйОборотыДтКт.СубконтоКт1 = вт_ПереводФР.СтатьяПереводФР
	 |			И УчетныйОборотыДтКт.Предприятия = вт_ПереводФР.Предприятие
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	УчетныйОборотыДтКт.Предприятия.Родитель,
	 |	УчетныйОборотыДтКт.Предприятия,
	 |	УчетныйОборотыДтКт.Период
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТ_Данные.Предприятия КАК Предприятия,
	 |	ВТ_Данные.Предприятия.ОсновнаяВалютаУчета КАК ПредприятияОсновнаяВалютаУчета,
	 |	ВТ_Данные.ТипПредприятия КАК ТипПредприятия,
	 |	ВТ_Данные.Период КАК Период,
	 |	ВТ_Данные.СуммаПереводФР * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) КАК СуммаПереводФР%Индекс%,
	 |	ВТ_Данные.СуммаНачало * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) КАК СуммаНачало%Индекс%,
	 |	ВТ_Данные.Сумма_90_91 * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) КАК Сумма_90_91%Индекс%,
	 |	(ВТ_Данные.Сумма_90_91 + ВТ_Данные.СуммаПереводФР) * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) КАК СуммаИтог%Индекс%
	 |ИЗ
	 |	ВТ_Данные КАК ВТ_Данные
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода {(&КонецПериода)}, БазоваяВалюта = &ЭквивалентнаяВалюта) КАК КурсыВалютСрезПоследних
	 |		ПО ВТ_Данные.Предприятия.ОсновнаяВалютаУчета = КурсыВалютСрезПоследних.Валюта
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода {(&КонецПериода)}, Валюта = &ЭквивалентнаяВалюта) КАК КурсЭквивалентнойВалюты
	 |		ПО ВТ_Данные.Предприятия.ОсновнаяВалютаУчета = КурсЭквивалентнойВалюты.БазоваяВалюта";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Индекс%", ИндексНабора);
	
	Возврат ТекстЗапроса;
	
КонецФункции
